<?php
/*
Plugin Name: ধন ধান্য পুষ্প ভরা
Plugin URI: http://www.superbcodes.com/
Description: ওয়ার্ডপ্রেসের "হ্যালো ডলি" প্লাগিনটা দেখার পর আমার ইচ্ছা হয় আমিও আমার প্রিয় কোন গান/কবিতা দিয়ে এরকম একটা প্লাগিন বানাবো।তো আমি দিজেন্দ্রলাল রায়ের লেখা "ধন ধান্য পুষ্প ভরা" দিয়ে প্লাগিনটি বানিয়েছি।প্লাগিনটির কোডিং এ যথা সম্ভব বাংলা ব্যাবহার করার চেষ্টা করেছি।প্লাগিনটি এক্টিভ্যাট করার পর এটি গানের বিভিন্ন পঙতি আপনার এডমিন প্যানেলের উপরে-ডান দিকে প্রদর্শন করবে।
Tag : ধন ধান্য পুষ্প ভরা,নাজমুল হোসেন নিহাল,বাংলা,কবিতা,গান,dhonodhanno,pushpo,bhora,bengali,bangla
Author: নাজমুল হোসেন নিহাল
Version: 1.0
Author URI: http://www.superbcodes.com/
*/

function ধন্যধান্য_পুষ্প_গানের_কথা() {
    /** ধন্যধান্যে পুষ্পেভরা গানটির কথা গুলো : */
    $কথা = "ধন ধান্য পুষ্প ভরা, আমাদের এই বসুন্ধরা,
তাহার মাঝে আছে দেশ এক সকল দেশের সেরা
ও সে স্বপ্ন দিয়ে তৈরী সেদেশ স্মৃতি দিয়ে ঘেরা
এমন দেশটি কোথাও খুঁজে পাবে নাকো তুমি
সকল দেশের রানী সে যে আমার জন্মভূমি
সে যে আমার জন্মভূমি, সে যে আমার জন্মভূমি
চন্দ্র সূর্য গ্রহ তারা, কোথায় উজান এমন ধারা
কোথায় এমন খেলে তড়িৎ, এমন কালো মেঘে
ও তারা পাখির ডাকে ঘুমিয়ে পড়ে পাখির ডাকে জেগে
এমন দেশটি কোথাও খুঁজে পাবে নাকো তুমি
সকল দেশের রানী সে যে আমার জন্মভূমি
সে যে আমার জন্মভূমি, সে যে আমার জন্মভূমি
এতো স্নিগ্ধ নদী তাহার, কোথায় এমন ধূম্র পাহাড়
কোথায় এমন হরিৎ ক্ষেত্র আকাশ তলে মেশে
এমন ধানের উপর ঢেউ খেলে যায়, বাতাস তাহার দেশে
এমন দেশটি কোথাও খুঁজে পাবে নাকো তুমি
সকল দেশের রানী সে যে আমার জন্মভূমি
সে যে আমার জন্মভূমি, সে যে আমার জন্মভূমি
পুষ্পে পুষ্পে ভরা শাখী, কুঞ্জে কুঞ্জে গাহে পাখি
গুঞ্জরিয়া আসে অলি, পুঞ্জে পুঞ্জে ধেয়ে
তারা ফুলের উপর ঘুমিয়ে পড়ে ফুলের মধু খেয়ে
এমন দেশটি কোথাও খুঁজে পাবে নাকো তুমি
সকল দেশের রানী সে যে আমার জন্মভূমি
সে যে আমার জন্মভূমি, সে যে আমার জন্মভূমি
ভাইয়ের মায়ের এতো স্নেহ, কোথায় গেলে পাবে কেহ
ও মা তোমার চরণ দুটি বুকে আমার ধরি
আমার এই দেশেতে জন্ম যেন এই দেশেতে মরি
এমন দেশটি কোথাও খুঁজে পাবে নাকো তুমি
সকল দেশের রানী সে যে আমার জন্মভূমি
সে যে আমার জন্মভূমি, সে যে আমার জন্মভূমি";

 
	$কথা = explode( "\n", $কথা );

	return wptexturize( $কথা[ mt_rand( 0, count( $কথা ) - 1 ) ] );
}

function ধন্যধান্য_পুষ্প() {
	$বাছাইকরা = ধন্যধান্য_পুষ্প_গানের_কথা();
	echo "<p id='ধন্যধান্য_পুষ্প'>" . $বাছাইকরা . "</p>";
}

add_action( 'admin_notices', 'ধন্যধান্য_পুষ্প' );

function ধন্যধান্য_পুষ্প_সিএসএস() {
	
	$এক্স = is_rtl() ? 'left' : 'right';

	echo "
	<style type='text/css'>
	#ধন্যধান্য_পুষ্প {
		float: " . $এক্স . ";
		padding-" . $এক্স . ": 15px;
		padding-top: 5px;		
		margin: 0;
		text-shadow: 5px 5px 5px #9D9D9D;
		font-size: 15px;
	}
	</style>
	";
}

add_action( 'admin_head', 'ধন্যধান্য_পুষ্প_সিএসএস' );

?>
